# Lab (sql-python-conection)
## Challenge
In this lab, the objective is to identify the customers who were active in both May and June, and how did their activity differ between months. To achieve this, follow these steps:
1. Establish a connection between Python and the Sakila database.
2. Write a Python function called `rentals_month` that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:
	- `engine`: an object representing the database connection engine to be used to establish a connection to the Sakila database.
	- `month`: an integer representing the month for which rental data is to be retrieved.
	- `year`: an integer representing the year for which rental data is to be retrieved.
	The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database, and return it as a pandas DataFrame.
3. Develop a Python function called `rental_count_month` that takes the DataFrame provided by `rentals_month` as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.
	The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".
	*Hint: Consider making use of pandas [groupby()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html)*
4. Create a Python function called `compare_rentals` that takes two DataFrames as input containing the number of rentals made by each customer in different months and years.
The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [ ]:
#!pip install pymysql
#!pip install sqlalchemy

In [1]:
import pandas as pd
import numpy as np

import pymysql                        # for getting data from a SQL database
from sqlalchemy import create_engine  # for establishing the connection and authentication

from getpass import getpass  # To get the password without showing the input

1. Establish a connection between Python and the Sakila database.

In [2]:
password = getpass()

········

In [3]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [4]:
# 'mysql+pymysql://': This is the database URL. You want to connect to a MySQL database using the PyMySQL driver

# root: This is the username used to connect to the MySQL database. 
    # In this case, it's set to 'root' a common default username for MySQL. 
    # Replace it with the actual username you use to connect to your MySQL database, idf necessary.
    # : as seperator
    # password variable stored you password from getpass() function above.
    # @localhost: This part specifies the host or server where the MySQL database is running. 
    # In this case, it's set to 'localhost', which means the database is on the same machine as the code.
    # If your database is on a different server, you would replace 'localhost' with the actual hostname or IP address of the MySQL
    # Make sure to include the correct database name (here sakila)

In [5]:
data = pd.read_sql_query('SELECT * FROM sakila.rental', engine)
data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [6]:
# pd alias for pandas
# read_sql_query() pandas function which applies SQL query on a database and retrieves the results into a pandas DataFrame
# SELECT * FROM sakila.rental (select everything from the rental table)
# engine contains information how to connect to the database

2. Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:

In [7]:
# I select a part of a string as a year --> substring(column_name, start_position index starting from 0, length_of_output)

def rentals_month (engine, year, month):
    query = "SELECT SUBSTRING(rental_date, 1, 4) AS year, SUBSTRING(rental_date, 6, 2) AS month FROM rental"

    month_year_dataframe = pd.read_sql_query(query, engine)

    return month_year_dataframe

In [8]:
# def "function_name" (arguments) (the arguments are engine, aear and month)
    # query (Contains the SQL Code in "" to extract the year and month information form the database without ; at the end)
        # SUBSTRING function is used to extract a portion of a string from a given string applied to the rental_date column
        # It takes 3 Parameters 
            # The string from which you want to extract the substring (here the rental date column)
            # The starting position (index) within the string from which the extraction begins, starting from 1.
            # The length of the substring to extract. Here, it's extracting the first 4 characters from rental_date for the year
    # read_sql_query() pandas function which applies SQL query on a database and retrieves the results into a pandas DataFrame
            # Here we use the variable query in the function to integrate the sql query
            # we use engine to establish the specific connection to the sakila database.
            # We store the dataframe in the variable month_year_dataframe
    # return the output of the function is our newly created "month_year_dataframe" variable.

In [9]:
example = rentals_month(engine, 2005, 5)

In [10]:
example

       year month
0      2005    05
1      2005    05
2      2005    05
3      2005    05
4      2005    05
...     ...   ...
16039  2006    02
16040  2006    02
16041  2006    02
16042  2006    02
16043  2006    02

[16044 rows x 2 columns]

In [11]:
# Test by calling the function "rentals_month(engine, year, month)" and storing it into the variable example. 
    # In the example I use 2005 for the year parameter and 5 for the month parameter.

3. Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.

The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".

Hint: Consider making use of pandas groupby()

In [12]:
def rental_count_month(df,month,year):
    column_name = f"rentals_{month:02}_{year}"
    query = f"""SELECT customer_id ,COUNT(rental_id) AS {column_name} 
    FROM rental 
    WHERE YEAR(rental_date) = {year} AND MONTH(rental_date) = {month} 
    GROUP BY customer_id
    """
    rental_count_df=pd.read_sql(query,engine)
    return rental_count_df

Source: https://realpython.com/python-f-strings/

In [13]:
# def "function_name" (dataframe month year) three parameters here dataframe df, month and year
    # df parameter is expected to be a DataFrame
    # month parameter integer representing the month
    # year parameter integer representing the year

#The function should also include the month and year as parameters and use them to name the new column according to the month and year
    # f"rentals_{month:02}_{year}": This is an f-string, which is a feature in Python for creating formatted strings. 
    # It allows you to embed expressions inside a string
    # You only need to start your string literal with a lowercase or uppercase f and then embed your values,
        # objects, or expressions in curly brackets at specific places
        
# query stores my SQL string 
    # f"""...""": f-string, allows you to embed Python expressions and variables inside a string.
    # COUNT(rental_id) AS {column_name}: This part calculates the count of rental records (rental_id) for each customer and gives it an alias. 
    # The alias is generated using the column_name variable in {} 
    # It will create a dynamic column name like "rentals_07_2023" based on the month and year values.
    
    
# WHERE YEAR(rental_date) = {year} AND MONTH(rental_date) = {month}: 
# It includes only those records where the year of the rental_date matches the provided year
# and the month of the rental_date matches the provided month. 
# The values of year and month are inserted into the query using curly braces {} inside the f-string, which will be replaced with their actual values.

# GROUP BY customer_id: This part groups the result set by the customer_id column, the first column I want as output. 
# Often used in combination with aggregate functions like COUNT to count rentals for each customer.

In [14]:
example2 = rental_count_month(example, 5, 2005)
example2

     customer_id  rentals_05_2005
0              1                2
1              2                1
2              3                2
3              5                3
4              6                3
..           ...              ...
515          594                4
516          595                1
517          596                6
518          597                2
519          599                1

[520 rows x 2 columns]

In [15]:
example3 = rental_count_month(example, 6, 2005)
example3
# Create two example outputs using the function rental_count_month with input dataframe example

     customer_id  rentals_06_2005
0              1                7
1              2                1
2              3                4
3              4                6
4              5                5
..           ...              ...
585          595                2
586          596                2
587          597                3
588          598                1
589          599                4

[590 rows x 2 columns]

4. Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [16]:
#4. What is the diference between the two months you are comparing

In [23]:
def compare_rentals(df1 ,df2):
    col_name_df1=df1.columns[1] #taking the column of first df using his location rather than his name,because the name might change
    col_name_df2=df2.columns[1] #same here
    
    combined_df = pd.concat([df1, df2], axis=1)
    combined_df = combined_df.reset_index(drop=True)
    combined_df.fillna(0, inplace=True)
    combined_df = combined_df.astype(int)
    
    combined_df["difference"] = combined_df[col_name_df1] - combined_df[col_name_df2] #create difference column with the difference between the 2 columns
    
    return combined_df

In [24]:
compare_rentals(example2,example3)

     customer_id  rentals_05_2005  customer_id  rentals_06_2005  difference
0              1                2            1                7          -5
1              2                1            2                1           0
2              3                2            3                4          -2
3              5                3            4                6          -3
4              6                3            5                5          -2
..           ...              ...          ...              ...         ...
585            0                0          595                2          -2
586            0                0          596                2          -2
587            0                0          597                3          -3
588            0                0          598                1          -1
589            0                0          599                4          -4

[590 rows x 5 columns]

In [ ]:
# Alternative result from my group, with a function I do not really understand

def compare_rentals(df1 ,df2):
    col_name_df1=df1.columns[1] #taking the column of first df using his location rather than his name,because the name might change
    col_name_df2=df2.columns[1] #same here
    
    #combine the dataframes
    # could not make the pd.concat work so i looked for other options like join or merge.
    # source https://ioflood.com/blog/pandas-concat/#:~:text=dataframes%20are%20merged.-,Exploring%20Alternative%20Concatenation%20Methods,()%20and%20join()%20functions.
    combined_df = df1.merge(df2, left_index=True, right_index=True)
    combined_df.fillna(0, inplace=True) #in case one dataframe is bigger than the other one,replace the nan values with 0
    combined_df["difference"] = combined_df[col_name_df1] - combined_df[col_name_df2] #create difference column with the difference between the 2 columns
    
    return combined_df

In [26]:
compare_rentals(example2,example3)

,customer_id_x,rentals_05_2005,customer_id_y,rentals_06_2005,difference
0,1,2,1,7,-5
1,2,1,2,1,0
2,3,2,3,4,-2
3,5,3,4,6,-3
4,6,3,5,5,-2
...,...,...,...,...,...
515,594,4,525,1,3
516,595,1,526,9,-8
517,596,6,527,4,2
518,597,2,528,2,0
519,599,1,529,3,-2

In [ ]:
def Summe_von_Zahlen(Zahl1, Zahl2):
    Summe = Zahl1 + Zahl2 
    Antwort =f"Summe von Zahl {Zahl1} und Zahl {Zahl2} ist {Summe}"
    
    return Antwort

In [ ]:
Antwort1 = Summe_von_Zahlen(5, 10)
Antwort1